{
  "meta": {
    "description": "Shanaaz Ahamed's personal portfolio",
    "title": "Shanaaz Ahamed | Portfolio",
    "keywords": "Shanaaz Ahamed, Shanaaz, Ahamed, imshaaz21, Shanaaz Ahamed Portfolio, Shanaaz Ahamed Resume, Shanaaz Ahamed Projects, Shanaaz Ahamed Blog, Shanaaz Ahamed Contact",
    "siteName": "Shanaaz Ahamed",
    "url": "https://imshaaz21.github.io",
    "image": "my-image.png",
    "type": "website"
  },
  "about": {
    "name": "Shanaaz Ahamed",
    "image": "my-image.png",
    "description": "Final-year Computer Science and Engineering student at the University of Moratuwa. Passionate about technology and innovation. Eager to learn and contribute to the field. Let's connect and explore opportunities together!",
    "cv": "/Shanaaz-Ahamed-CV.pdf",
    "socials": {
      "github": "https://github.com/imshaaz21",
      "linkedin": "https://www.linkedin.com/in/imshaaz",
      "email": "shaanaaz.19@cse.mrt.ac.lk"
    }
  },
  "experiences": [
    {
      "position": "Data Science Intern",
      "workplace": "Dialog Axiata PLC, Colombo, Sri Lanka",
      "date": "Jan 2023 - Jun 2023",
      "descriptions": [
        "Woked in the MDT data processing visualization project and developed a web application to visualize the data using React and Python, with the help of Networking and Access Planning team.",
        "Developed a anomaly detecttion model using facebook's Prophet library to detect anomalies in the network data"
      ]
    },
    {
      "position": "Freelance Developer and Programming Tutor",
      "workplace": "Fiverr",
      "date": "Feb 2022 - Present",
      "descriptions": [
        "Level 2 seller with more than 85 5-Star Rating",
        "Developed web and mobile applications using various technologies such as  React, ReactNative Node.js, Express.js, SpringBoot, Python, MongoDB, MySQL and many more",
        "Served for clients from USA, UK, Australia, Canada, and many more countries."
      ]
    },
    {
      "position": "Full Stack Developer Intern",
      "workplace": "Gravity Colombo, Sri Lanka",
      "date": "Jun 2023 - Dec 2023",
      "descriptions": [
        "Developed mobile applications using ReactNative",
        "Woked as a backend developer for the web applications using Node.js, Express.js, MongoDB"
      ]
    }
  ],
  "educations": [
    {
      "field": "BSc. (Hons) in Computer Science and Engineering",
      "place": "University of Moratuwa, Sri Lanka",
      "date": "2020 - 2024",
      "descriptions": ["Dean's List: 2nd semester"]
    },
    {
      "field": "GCE Advanced Level",
      "place": "Kekunagolla National School, Kurunegala",
      "date": "2018",
      "descriptions": [
        "Stream: Physical Science",
        "Results: 2A's and 1B, Z-Score: 1.9634"
      ]
    },
    {
      "field": "GCE Ordinary Level",
      "place": "Minhath National School, Dikwella",
      "date": "2015",
      "descriptions": ["Results: 7A's, 1B, 1C"]
    }
  ],
  "projects": [
    {
      "title": "Crop Monitoring Smart Agriculture",
      "description": "Crop Monitoring Smart Agriculture optimizes fertilizer application with a portable device measuring key soil parameters. An Android app (Flutter) visualizes data, including plant leaf disease detection, transmitted via Bluetooth Low Energy. Hardware includes Arduino Uno, DHT22 sensor, soil moisture sensor, and HC-05 Bluetooth module.",
      "image": "https://user-images.githubusercontent.com/77115237/190918463-30444397-b4fa-42d4-a588-f7cb4a0e9d99.png",
      "link": "https://github.com/imshaaz21/Crop-Monitoring-Smart-Agriculture"
    },
    {
      "title": "The Bank App",
      "description": "TheBankApp extends banking reach with mobile devices, enabling essential services like withdrawals, deposits, and balance inquiries through local agents. It syncs transactions with a centralized database, supports account management, interest calculation, and offers fixed deposit plans. User-friendly interfaces enhance accessibility.",
      "image": "micro-bank.webp",
      "link": "https://github.com/imshaaz21/TheBankApp"
    },
    {
      "title": "Spiking Neural Network on FPGA",
      "description": "This project implements a Spiking Neural Network (SNN) on FPGA for real-time image processing. Using VHDL, it mimics biological neuron behavior, optimized for color detection like crosswalks. Python aids in training and normalization. Future steps include resolving detection issues and expanding to video frame analysis for driver alerts.",
      "image": "https://github.com/imshaaz21/Spiking-Neural-Network-on-FPGA/raw/main/Sources/images/snn.gif",
      "link": "https://github.com/imshaaz21/Spiking-Neural-Network-on-FPGA"
    },
    {
      "title": "Fish Tank Monitoring System",
      "description": "The Fish Tank Monitoring System comprises pH and turbidity monitoring, and automated feeding. The pH meter, using an Arduino and RaspberryPi, detects pH levels and alerts via an Android app. Turbidity is assessed through image processing. The feeding system, controlled by a servo motor, offers scheduled or manual feeding.",
      "image": "https://user-images.githubusercontent.com/77115237/190552397-5318eeb5-e281-4473-b809-dc97bcf0f1cd.png",
      "link": "https://github.com/imshaaz21/Fish-Tank-Monitoring-System"
    },
    {
      "title": "N-Puzzle",
      "description": "N-Puzzle involves rearranging tiles on a board using the A* algorithm. The task focuses on a variant with two vacancies. Randomly generated test cases are analyzed using heuristics like misplaced tiles and Manhattan Distance, showing no significant difference. Statistical analysis confirms this using Python libraries.",
      "image": "https://media.geeksforgeeks.org/wp-content/uploads/a_-search-algorithm-1.png",
      "link": "https://github.com/imshaaz21/N-Puzzle"
    },
    {
      "title": "Canny Edge Detection",
      "description": "Canny Edge Detection in Python is an image processing technique developed from scratch. It identifies edges through grayscale conversion, Gaussian blurring, gradient estimation, non-maximum suppression, and dual thresholding. Ideal for computer vision tasks, it requires Python, NumPy, and Matplotlib for implementation.",
      "image": "cannyEdge.png",
      "link": "https://github.com/imshaaz21/CannyEdgeDetection"
    }
  ],
  "contact": {
    "email": "shaanaaz.19@cse.mrt.ac.lk",
    "name": "Shanaaz Ahamed"
  }
}
